Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 31, 200)           1000000   
_________________________________________________________________
lstm (LSTM)                  (None, 31, 256)           467968    
_________________________________________________________________
lstm_1 (LSTM)                (None, 288)               627840    
_________________________________________________________________
dense (Dense)                (None, 2)                 578       
=================================================================
Total params: 2,096,386
Trainable params: 2,096,386
Non-trainable params: 0
_________________________________________________________________
