Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 31, 200)           1000000   
_________________________________________________________________
lstm (LSTM)                  (None, 31, 320)           666880    
_________________________________________________________________
lstm_1 (LSTM)                (None, 192)               393984    
_________________________________________________________________
dense (Dense)                (None, 2)                 386       
=================================================================
Total params: 2,061,250
Trainable params: 2,061,250
Non-trainable params: 0
_________________________________________________________________
